#Использовать "."

Перем Задачи;
Перем Методы;

Функция ОбъектыМодификации(Знач ИзменныеФайлыПоЗадаче)
	
	ОбъектыМодификации	= Новый Массив();
	
	Для Каждого Строка Из ИзменныеФайлыПоЗадаче Цикл
		Слово = Строка;
		Слово = СтрЗаменить(Слово, "- Изменения в объекте конфигурации", "");
		Слово = СтрЗаменить(Слово, "- Изменения в предопределенных данных", "");
		Слово = СтрЗаменить(Слово, ".МодульОбъекта", "");
		Слово = СтрЗаменить(Слово, ".МодульМенеджера", "");
		Слово = СтрЗаменить(Слово, ".МодульКоманды", "");
		Слово = СокрЛП(Слово);		
		Если ОбъектыМодификации.Найти(Слово) = Неопределено Тогда
			ОбъектыМодификации.Добавить(Слово);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбъектыМодификации; 

КонецФункции

Процедура НайтиКоммитыПоЗаданномуКомментариюИВывестиСписокФайловВФайл(МассивКомментариев, ИмяФайлаВывода, Репозиторий) Экспорт

	ИзменныеФайлыПоЗадаче = Новый Массив();
	Для Каждого Комментарий Из МассивКомментариев Цикл
		Текст			= Задачи.НайтиКоммитыСЗаданнымКомментарием(Комментарий);
		КоммитыМассивом = Задачи.ПривестиКоммитыКШаблонуЗадачаСписокФайлов(Текст);	
		Для Каждого Строка Из КоммитыМассивом Цикл
			ИменаИзменныхВКоммитеФайлов 	= Задачи.ИменаИзменныхВКоммитеФайлов(Строка.ХешКоммита);
			Для Каждого ИмяФайла Из ИменаИзменныхВКоммитеФайлов	 Цикл
				ИмяФайлаПоСтандартамСонарКуба   = Методы.ИмяФайлаПоРедмайна(ИмяФайла, Репозиторий);
				Если ИзменныеФайлыПоЗадаче.Найти(ИмяФайлаПоСтандартамСонарКуба) = Неопределено Тогда
					ИзменныеФайлыПоЗадаче.Добавить(ИмяФайлаПоСтандартамСонарКуба);
				КонецЕсли;		
			КонецЦикла;	
		КонецЦикла;
	КонецЦикла;

	СписокЗначений = Новый СписокЗначений();
	СписокЗначений.ЗагрузитьЗначения(ИзменныеФайлыПоЗадаче);
	СписокЗначений.СортироватьПоЗначению();
	ИзменныеФайлыПоЗадаче	= СписокЗначений.ВыгрузитьЗначения();

	Текст = Новый ТекстовыйДокумент();
	Текст.ДобавитьСтроку("ПРОВЕРЬ нужны ли $+");
	Текст.ДобавитьСтроку(СтрСоединить(ИзменныеФайлыПоЗадаче, Символы.ПС));
			
	Текст.ДобавитьСтроку("");
	Текст.ДобавитьСтроку("");
	Текст.ДобавитьСтроку("");
	
	Текст.ДобавитьСтроку("Объекты модификации:");
	ОбъектыМодификации = ОбъектыМодификации(ИзменныеФайлыПоЗадаче);
	Текст.ДобавитьСтроку(СтрСоединить(ОбъектыМодификации, Символы.ПС));

	Текст.Записать(ИмяФайлаВывода, КодировкаТекста.Системная);
	Сообщить("Обработка завершена. Смотри результат в " + ИмяФайлаВывода);

КонецПроцедуры

Задачи = Новый gitlog();
Методы = Новый ОбщиеМетоды();
Настройки 			= Задачи.ИницилизацияПеременных(АргументыКоманднойСтроки);
Репозиторий			= Настройки.Получить("Репозиторий");
МассивКомментариев 	= Настройки.Получить("МассивКомментариев"); // "b911c27cb0d580345e", "https://ekk2.kaiten.ru/1731"
ИмяФайла			= Настройки.Получить("ИмяФайлаИзменныхКоммитамиФайлов"); //"D:\\gitlog\\text.txt"
НайтиКоммитыПоЗаданномуКомментариюИВывестиСписокФайловВФайл(МассивКомментариев, ИмяФайла, Репозиторий);